q1 = {
    'Самой вкусной рыбой Черного моря считают': ['Кефаль', 'Камбала', 'Султанка', 'Скумбрия'],
    'С каким камнем сравнили цвет воды в бухте': ['Алмаз', 'Топаз', 'Бирюза', 'Изумруд'],
    'С какой птицей сравнили купающихся бухте мальчишек': ['Утка', 'Чайка', 'Баклан', 'Буревестник'],
    'Что напоминали глаза греков': ['Черные впадины', 'Мутные озера', 'Крупные Маслины', 'Мелкие Маслины'],
    'Что сбывали на рынке': ['Новую обувь', 'Ворованные часы', 'Бабушкин хрусталь', 'Поношенное платье'],
}

q2 = {
    'Чем окаймлялись длинные аллеи сада': ['Хмелем', 'Виноградом', 'Клематисами', 'Розами'],
    'На какой город открывался вид из деревянного бельведера': ['Севастополь', 'Сочи', 'Одесса', 'Симферополь'],
    'Какую работу не выполняли арестанты в саду': ['Поливали цветники', 'Подстригали деревья', 'Мели дорожки', 'Собирали букеты цветов'],
    'Сколько арестантов работало в саду': ['Не более 5 человек', 'Не более 10 человек', 'Не более 15 человек', 'Не более 2 человек'],
    'Какое растение сада сравнили с янтарем': ['Персик', 'Груша', 'Абрикос', 'Ранет'],
}

q3 = {
    'Что получал на большой перемене отец': ['Не то суп, не то кашу', 'Не то суп, не то кулеш', 'И суп и кашу', 'И суп и картошку'],
    'Чем был посыпан сверху хлеб': ['Тмин', 'Орешки', 'Мука', 'Ничем не посыпан'],
    'На листьях какого дерева выпекался хлеб': ['Дуб', 'Береза', 'Тополь', 'Клен'],
    'От чего бок хлеба имел трещину': ['От ножа', 'От жара печи', 'От черствости', 'Хлеб не имел трещин'],
    'Какой формы был каравай': ['Округлой', 'Прямоугольной', 'Вытянутой', 'Продолговатой'],
}

q4 = {
    'Почему концовка аттракциона «головой вниз» осталась не выясненной': ['Героиня аттракциона орала', 'Героиня аттракциона плакала', 'Героиня аттракциона ушла', 'Героиня аттракциона упала'],
    'Что выступало в аттракционе в роли «змеи»': ['Веревка', 'Коса', 'Чучело змеи', 'Лента'],
    'На чем сидели сестры во время силового аттракциона': ['Метла', 'Лопата', 'Палка', 'Кочерга'],
    'Из чего была сделана дверная ручка': ['Из слоновой кости', 'Из золота', 'Из меди', 'Из дерева'],
    'В скольких аттракционах была задействована Нинина коса': ['В двух', 'Во всех', 'В одном', 'В трех'],
}

q5 = {
    'С какого возраста Аленка пишет буквы': ['С 6 лет', 'Еще не умеет писать', 'С 4 лет', 'С 7 лет'],
    'Какие организмы изучает Аленкин папа': ['Моллюски', 'Змеи', 'Лягушки', 'Рыбы'],
    'Какую змею Алена носила за пазухой': ['Гадюка', 'Уж', 'Питон', 'Удав'],
    'Почему Алене нравятся лягушки': ['Потому что лупоглазые и холодные', 'Потому что зеленые и поют хором', 'Потому что скользкие и мокрые', 'Потому что лупоглазые и поют хором'],
    'Что на опыте проверяла Алена у лягушек': ['Терморегуляцию', 'Репродукцию', 'Микроциркуляцию', 'Опыты с лягушками не проводила'],
}

q6 = {
    'Чего испугались летучие мыши в пещере': ['Человека', 'Луча от фонаря', 'Громких звуков', 'Хлопков'],
    'Из чего был построен домик для домашних мышат': ['Из коробки от торта', 'Из коробки от печенья', 'Из коробки от конфет', 'Из дерева'],
    'Что сделал с рукописью герой произведения, когда застал мышат за ее поеданием': ['Перепечатал заново', 'Выбросил в мусор', 'Спрятал в шкаф', 'Отнес в редакцию'],
    'Что предпочел издатель рукописи героя': ['Чай с печеньем', 'Бутерброд с ливерной колбасой', 'Бутерброд с сыром', 'Бутерброд с ветчиной'],
    'Сколько мышат жило у героя дома': ['Один', 'Более трех', 'Двое', 'Более пяти'],
}

q7 = {
    'Почему герой произведения не мог восхищаться окружающей его ледяной красотой': ['Лед таял', 'Герой не любил зиму', 'Было очень холодно', 'Герой не замечал, что его окружает'],
    'Какая ледяная мебель была в сарае': ['Табурет', 'Диван', 'Стул', 'Кресло'],
    'Как закрывались в двери в сарай': ['Замыкались на большой замок', 'Засыпались снегом', 'Вместо дверей были ледяные глыбы', 'Заливались водой и замерзали'],
    'Что хранилось в сарае': ['Старая мебель', 'Продукты', 'Всякий хлам', 'Сарай был пустой'],
    'Почему герой любил подледную рыбалку': ['Много рыбы ловилось', 'Интересно бурить лунки', 'Вокруг была красота и тишина', 'Из-за холода'],
}

q8 = {
    'Какие были люди племени Земзе': ['Огромной силы и большого роста', 'Слабые карлики', 'Высокие, но слабые', 'Сильные и коренастые'],
    'Каким необыкновенным свойством отличались люди Земзе': ['Могли примагничивать к себе предметы', 'Обладали телепортацией', 'На расстоянии чувствовали природу и форму вещей', 'Управляли предметами на расстоянии'],
    'Кто являлся покровителем племени': ['Муха', 'Тигр', 'Скорпион', 'Птица'],
    'Чем были покрыты каменные здания города': ['Деревом', 'Тростником', 'Соломой', 'Бамбуком'],
    'Посредством чего люди племени записывали мысли': ['С помощью букв', 'Изображение предметов', 'Клинопись', 'Писали на древнем языке'],
}

q9 = {
    'Какие овощи собирала бабка в огороде': ['Помидоры', 'Горох', 'Огурцы', 'Морковь'],
    'Что дал в руки малышу Сима Симаков': ['Перо из крыла вороны', 'Перо из крыла орла', 'Перо из крыла утки', 'Перо из крыла галки'],
    'С каким животным сравнивает автор беглую козу': ['Тигр', 'Леопард', 'Собака', 'Косуля '],
    'Чем стегнула бабка Симу Симакова': ['Прутом', 'Крапивой', 'Полотенцем', 'Палкой'],
    'Сколько человек укладывали поленницу': ['Трое', 'Шестеро', 'Пятеро', 'Четверо'],
}

q10 = {
    'Из чего сделан пол домика на дереве': ['Из пальмовых листьев', 'Из бамбука', 'Из тростника', 'Из дерева'],
    'На чем сидят во время обеда за столом': ['На циновке', 'На стуле', 'На корточках', 'На полене'],
    'Как долго длится сезон дождей': ['С сентября по июнь', 'С июля по сентябрь', 'С июня по август', 'С июня по сентябрь'],
    'Кто охраняет продуктовые склады': ['Охотники', 'Собаки', 'Обезьяны', 'Склады стоят без охраны'],
    'Чем занимаются куки в сезон дождей': ['Охотой', 'Предаются размышлениям', 'Шьют одежду', 'Ремонтируют дома'],
}

links = {
    'В ледяном плену': q7,
    'Вкус хлеба': q3,
    'Дом на деревьях': q10,
    'Дрова': q9,
    'Моя ближайшая подруга Алёна': q5,
    'Мыши': q6,
    'Народное гулянье': q4,
    'Племя Земзе': q8,
    'Старый сад': q2,
    'Южный рынок': q1,
}

answers = {
    'В ледяном плену': {'Было очень холодно', 'Табурет', 'Заливались водой и замерзали', 'Продукты', 'Вокруг была красота и тишина'},
    'Вкус хлеба': {'Не то суп, не то кулеш', 'Тмин', 'Клен', 'От жара печи', 'Округлой'},
    'Дом на деревьях': {'Из тростника', 'На циновке', 'С июня по сентябрь', 'Обезьяны', 'Предаются размышлениям'},
    'Дрова': {'Огурцы', 'Перо из крыла галки', 'Тигр', 'Крапивой', 'Четверо'},
    'Моя ближайшая подруга Алёна': {'С 4 лет', 'Моллюски', 'Уж', 'Потому что лупоглазые и поют хором', 'Терморегуляцию'},
    'Мыши': {'Луча от фонаря', 'Из коробки от торта', 'Отнес в редакцию', 'Бутерброд с ливерной колбасой', 'Двое'},
    'Народное гулянье': {'Героиня аттракциона орала', 'Коса', 'Кочерга', 'Из меди', 'В двух'},
    'Племя Земзе': {'Огромной силы и большого роста', 'На расстоянии чувствовали природу и форму вещей', 'Птица', 'Тростником', 'Изображение предметов'},
    'Старый сад': {'Виноградом', 'Севастополь', 'Собирали букеты цветов', 'Не более 15 человек', 'Ранет'},
    'Южный рынок': {'Султанка', 'Изумруд', 'Утка', 'Крупные Маслины', 'Поношенное платье'},
}
